# https://github.com/ptb/mac-setup/blob/develop/mac-setup.command

cask "iterm2-nightly"
brew "mas", args: ["--build-from-source"]
brew "svn"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "varenc/ffmpeg"

mas "ArtSaverApp", id: 1528854781
#cask "wacom-tablet"
# cask "wacom-inkspace"
# cask "synergy"

cask "lulu"

mas "Time Out", id: 402592703
mas "One Thing", id: 1604176982
mas "Shareful", id: 1522267256
mas "Tot", id: 1491071483

brew "rectangle"
cask "karabiner-elements"
cask "homebrew/cask-drivers/kiibohd-configurator"
cask "kiibohd-configurator"
cask "mos" # scroll control

brew "asdf"
brew "deno"
brew "crystal"
#brew "pyenv"
brew "ruby-completion"
brew "ruby-install"
brew "rbenv"
brew "rbenv-gemset"
brew "ruby-build"
brew "rust"
#brew "nvm"
brew "sbt"
brew "scala"
brew "yarn"
brew "elixir"
brew "elixir-build"
brew "awscli"
brew "aws-sam-cli"


#brew "circleci"
brew "devspace"
brew "dosbox"
brew "gh"
brew "vault"

cask "adoptopenjdk"
cask "xquartz"
cask "suspicious-package"
cask "visualvm"
cask "platypus"

brew "vim"
cask "visual-studio-code"
cask "intellij-idea-ce"
#cask "android-studio-preview"
brew "jupyterlab"
brew "miniconda"
brew "conda-zsh-completion"
cask "datagrip"
cask "db-browser-for-sqlite"
cask "timeular"

cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-lgc"
cask "font-photonico-code"


brew "exa"
brew "lsd"
brew "tmux"
brew "zsh"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "fzf"
brew "bash-completion"
brew "bash-git-prompt"
brew "mosh"
brew "bundler-completion"
brew "curl"
brew "curl-openssl"
brew "wget"

cask "transmission"
brew "i2p"
brew "ipfs", args: ["--build-from-source"]

brew "jq"
brew "ijq"
brew "bat"
brew "renameutils", args: ["--build-from-source"]
brew "python-yq"
brew "socat"
brew "tree"

mas "GrandPerspective", id: 1111570163
mas "HEIC Converter", id: 1294126402
mas "Control Center", id: 1515453657
mas "SiteSucker", id: 442168834
mas "Spectrum Analyzer", id: 1049212349

## Browsers

cask "google-chrome"
cask "google-chrome-canary"
cask "chromedriver"
cask "firefox-nightly"
cask "firefox"
cask "safari-technology-preview"
cask "tor-browser"
cask "opera"
cask "brave-browser-nightly"
#cask "microsoft-edge"

cask "finicky"
mas "Cascadea", id: 1432182561
mas "Refined GitHub", id: 1519867270


## Chat

brew "irssi"
cask "notion"
cask "skype"
cask "zoom"
cask "discord"
# cask "keybase"
#mas "Rocket.Chat", id: 1086818840
#mas "Jira", id: 1475897096
#mas "Slack", id: 803453959

brew "figlet"
brew "brogue"
cask "angband"
cask "google-earth-pro"


brew "cocoapods"
brew "duti"
brew "ios-deploy"
brew "ideviceinstaller"

## Virtualization

brew "docker"
brew "docker-compose"
brew "docker-machine"
cask "captain"
cask "virtualbox"

brew "minikube", args: ["--build-from-source"]
brew "kubernetes-cli"
brew "kubectl"
brew "minikube"
brew "hidetatz/tap/kubecolor"
brew "k9s"

brew "argo"
tap "hyperledger/fabric"
brew "hyperledger/fabric/fabric-tools@1.4.0"
brew "hyperledger/fabric/fabric-tools@2.1.0"

## Network

cask "postman"
cask "ngrok"
brew "dnsmasq"
brew "dnsviz"
brew "doggo"
brew "ettercap"
brew "ncdu"
brew "nmap"
cask "nzbvortex"
cask "wireshark"

## auth

brew "oath-toolkit"
brew "pinentry-mac"
cask "gpg-suite"
brew "git-secret"
cask "tunnelbear"
cask "openvpn-connect"

## Git

brew "reattach-to-user-namespace"
brew "popt"
brew "hub"
brew "git-lfs"
brew "legit"
brew "git-delta"


#brew "fasd"
brew "aspell"
brew "pcre2"
brew "poppler"
brew "potrace"
brew "intltool"
brew "p7zip"
#brew "unrar"
brew "aview"
brew "colordiff"
brew "diff-so-fancy"
brew "cscope"
brew "ctags"
brew "the_silver_searcher"
brew "ack"
brew "gawk"
brew "awk"
brew "parallel"
brew "progress"
brew "markdown"
mas "RegEx Lab", id: 1252988123
mas "Gemini 2", id: 1090488118


brew "pow"
brew "automake"
brew "cmake"
brew "gradle"
brew "maven"
brew "mcrypt"
brew "stow"
brew "llvm"
brew "readline"
brew "xz"
cask "adoptopenjdk8"

tap "mongodb/brew"

brew "neo4j", link: false
brew "sqlite"
brew "freetds"
brew "mysql", restart_service: true
brew "nginx", restart_service: true
brew "postgresql", restart_service: true
brew "mongodb/brew/mongocli"
cask "sequel-pro-nightly"
cask "sqlworkbenchj"
cask "valentina-studio"

brew "avro-tools"
brew "avro-c"
brew "kafka"
brew "rabbitmq"
brew "redis", restart_service: true
# brew "temporal"

cask "r"
cask "racket"
cask "protege"
brew "sphinx-doc"
brew "stanford-corenlp"
cask "julia"
brew "vowpal-wabbit", args: ["--build-from-source"]

brew "blender"
brew "graphviz"
brew "plantuml"
cask "inkscape"
cask "gimp"
cask "omnigraffle"
cask "omnigraffle6"
#mas "skitch"
cask "sketch"
cask "drawio"

cask "rive"
mas "GIPHY CAPTURE", id: 668208984
mas "Skitch", id: 425955336

brew "tesseract"
brew "imagemagick"
brew "djvu2pdf"
brew "djvulibre"
brew "pdf-diff"
brew "d2"


cask "vlc"
brew "ffmpeg"
brew "youtube-dl"
brew "yt-dlp/taps/yt-dlp"
brew "gallery-dl"

brew "gsl"
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "libzip"
brew "libiconv"
brew "libpq"
brew "libsodium"
brew "libsoup"
brew "libvpx"
brew "libxml++"
brew "libxml++3"
brew "little-cms"
brew "zlib"
brew "libxml2"
brew "glib"
brew "libimobiledevice"
brew "libusbmuxd"
brew "tidy-html5"
brew "xvid"
brew "libheif"

cask "qlimagesize"
cask "qlstephen"
cask "qlvideo"
cask "qlstephen"
cask "quicklookase"
cask "webpquicklook"

##mas "Numbers", id: 409203825
##mas "Pages", id: 409201541
#mas "Skitch", id: 425955336
#mas "The Unarchiver", id: 425424353
#mas "Time Out", id: 402592703
#mas "Transmit", id: 1436522307
#mas "TweetDeck", id: 485812721
##mas "Xcode", id: 497799835
##mas "iPhoto", id: 408981381
#
#mas "ChmPages", id: 1164062917
##mas "Duplicate Cleaner For iPhoto", id: 586862299
##mas "Duplicate Photos Finder", id: 984929789
#mas "Gemini 2", id: 1090488118
#mas "GrandPerspective", id: 1111570163
#mas "FreeDiskSpace", id: 838744420
#mas "SiteSucker", id: 442168834
#mas "Tot", id: 1491071483

# cask "dash"
cask "mactex"
cask "latexit"
cask "macdown"
# cask "gitkraken"
#
