# https://github.com/ptb/mac-setup/blob/develop/mac-setup.command

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "varenc/ffmpeg", pin: true

cask "homebrew/cask-drivers/kiibohd-configurator"
cask "pomotodo"
cask "time-out"
cask "karabiner-elements"
cask "wacom-tablet"
cask "wacom-inkspace"
cask "lulu"
cask "kiibohd-configurator"
cask "captain"

cask "adoptopenjdk"
cask "xquartz"
cask "suspicious-package"
cask "virtualbox"
cask "visualvm"
cask "platypus"
cask "postman"

cask "dash"
cask "mactex"
cask "latexit"
cask "macdown"
cask "gitkraken"

brew "vim"
cask "iterm2-nightly"

cask "visual-studio-code"
cask "sublime-text2"
cask "intellij-idea-ce"
cask "android-studio-preview"

cask "homebrew/cask-fonts/font-inconsolata-lgc"
cask "font-firacode-nerd-font-mono"
cask "font-hack-nerd-font"
cask "font-inconsolata-lgc"

cask "openvpn-connect"
cask "transmission"

brew "irssi"
cask "nzbvortex"
brew "wireshark"
cask "notion"
cask "skype"
cask "zoomus"
cask "google-hangouts"
cask "discord"
cask "keybase"
cask "webex-teams"

brew "figlet"
brew "brogue"
cask "google-earth-pro"

cask "google-chrome"
cask "google-chrome-canary"
cask "chromedriver"
cask "firefox-nightly"
cask "firefox"
cask "safari-technology-preview"
cask "tor-browser"
cask "opera"
cask "brave-browser-nightly"

brew "cocoapods"
brew "duti"
brew "ios-deploy"
brew "ideviceinstaller"
brew "mas"
brew "pinentry-mac"

brew "docker"
brew "docker-compose"
brew "docker-machine"
brew "gdl"
brew "heroku/brew/heroku"
cask "docker"

brew "zsh"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "bash-completion"
brew "bash-git-prompt"
brew "mosh"
brew "bundler-completion"
brew "curl"
brew "curl-openssl"
brew "wget"
brew "jq"
brew "bat"
brew "renameutils"

brew "dnsmasq"
brew "ncdu"
#brew "fasd"
brew "ack"
brew "aspell"
brew "pcre2"
brew "poppler"
brew "popt"
brew "potrace"
brew "intltool"
brew "ipfs"
brew "nmap"
brew "p7zip"
brew "unrar"
brew "reattach-to-user-namespace"

cask "gpg-suite"
brew "tmux"
brew "hub"
brew "git-secret"
brew "git-lfs"
brew "legit"
brew "aview"
brew "colordiff"
brew "diff-so-fancy"
brew "cscope"
brew "ctags"
brew "the_silver_searcher"
brew "parallel"
brew "progress"
brew "awk"
brew "markdown"

brew "jupyterlab"

brew "pow"
brew "automake"
brew "cmake"
brew "gradle"
brew "maven"
brew "mcrypt"
brew "stow"
brew "llvm"
brew "readline"
brew "xz"
cask "adoptopenjdk8"

brew "asdf"
brew "crystal"
brew "pyenv"
brew "ruby-completion"
brew "ruby-install"
brew "ruby-build"
brew "rust"
brew "nvm"
brew "sbt"
brew "scala"
brew "yarn"
brew "elixir"
brew "elixir-build"
brew "awscli"

cask "db-browser-for-sqlite"
cask "neo4j"
brew "sqlite"
brew "freetds"
brew "mysql", restart_service: true, link: false
brew "neo4j", link: false
brew "postgresql", restart_service: true
brew "v8"
cask "sequel-pro-nightly"
cask "sqlworkbenchj"
cask "valentina-studio"

brew "avro-tools"
brew "avro-c"
brew "kafka"
brew "rabbitmq"
brew "redis", restart_service: true

brew "r"
cask "racket"
cask "protege"
brew "jupyter"
brew "sphinx-doc"
brew "stanford-corenlp"
cask "julia"
brew "vowpal-wabbit"

brew "graphviz"
brew "plantuml"
cask "inkscape"
cask "gimp"
cask "omnigraffle"
cask "omnigraffle6"
cask "skitch"
cask "sketch"
cask "drawio"

brew "tesseract"
brew "imagemagick"

cask "vlc"
brew "varenc/ffmpeg/ffmpeg"
brew "youtube-dl"
brew "gsl"
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "libzip"
brew "libiconv"
brew "libpq"
brew "libsodium"
brew "libsoup"
brew "libvpx"
brew "libxml++"
brew "libxml++3"
brew "little-cms"
brew "zlib"
brew "libxml2"
brew "glib"
brew "libimobiledevice"
brew "libusbmuxd"
brew "tidy-html5"

cask "qlimagesize"
cask "qlstephen"
cask "qlvideo"
cask "qlstephen"
cask "quicklookase"
cask "webpquicklook"

mas "Autodesk Pixlr", id: 880663569
mas "FreeDiskSpace", id: 838744420
mas "Instapaper", id: 1481302432
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "SIDT", id: 1308724728
mas "Skitch", id: 425955336
mas "The Unarchiver", id: 425424353
mas "Time Out", id: 402592703
mas "Transmit", id: 1436522307
mas "TweetDeck", id: 485812721
mas "Wayback Machine", id: 1472432422
mas "Xcode", id: 497799835
mas "iPhoto", id: 408981381

mas "ChmPages", id: 1164062917
mas "Duplicate Cleaner For iPhoto", id: 586862299
mas "Duplicate Photos Finder", id: 984929789
mas "Furiganify!", id: 1151320968
mas "GarageBand", id: 682658836
mas "Gemini 2", id: 1090488118
mas "GrandPerspective", id: 1111570163
mas "SiteSucker", id: 442168834
mas "Slack", id: 803453959
mas "Tot", id: 1491071483
mas "iMovie", id: 408981434

