# https://github.com/ptb/mac-setup/blob/develop/mac-setup.command

cask "iterm2-nightly"
brew "mas", args: ["--build-from-source"]
brew "svn"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "varenc/ffmpeg"

mas "ArtSaverApp", id: 1528854781
#cask "wacom-tablet"
# cask "wacom-inkspace"
# cask "synergy"

cask "lulu"

mas "Time Out", id: 402592703
mas "One Thing", id: 1604176982
mas "Shareful", id: 1522267256
mas "Tot", id: 1491071483

## ??

cask "rectangle"
cask "karabiner-elements"
cask "homebrew/cask-drivers/kiibohd-configurator"
cask "kiibohd-configurator"
cask "mos" # scroll control

## ??

brew "asdf"
brew "deno"
brew "crystal"
#brew "pyenv"
brew "ruby-completion"
brew "ruby-install"
brew "rbenv"
brew "rbenv-gemset"
brew "ruby-build"
brew "rust"
#brew "nvm"
brew "sbt"
brew "scala"
brew "yarn"
brew "elixir"
brew "elixir-build"
brew "awscli"
brew "aws-sam-cli"

## hardware
cask "balenaetcher"

## ??

#brew "circleci"
brew "devspace"
brew "dosbox"
brew "gh"
brew "vault"

## ??

cask "adoptopenjdk"
cask "xquartz"
cask "suspicious-package"
cask "visualvm"
cask "platypus"

## ??

brew "vim"
cask "visual-studio-code"
cask "intellij-idea-ce"
#cask "android-studio-preview"
brew "jupyterlab"
brew "miniconda"
brew "conda-zsh-completion"
cask "datagrip"
cask "db-browser-for-sqlite"
cask "timeular"

## Font

cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-lgc"
cask "font-photonico-code"

## Terminal Utils

brew "bash-completion"
brew "bash-git-prompt"
brew "bat"
brew "bundler-completion"
brew "curl-openssl"
brew "curl"
brew "exa"
brew "fzf"
brew "ijq"
brew "jq"
brew "lsd"
brew "mosh"
brew "python-yq"
brew "renameutils", args: ["--build-from-source"]
brew "socat"
brew "tree"
brew "wget"
brew "zsh-completions"
brew "zsh-git-prompt"

mas "GrandPerspective", id: 1111570163
mas "HEIC Converter", id: 1294126402
mas "Control Center", id: 1515453657
mas "SiteSucker", id: 442168834
mas "Spectrum Analyzer", id: 1049212349

## Terminal Layout

brew "tmux"
brew "zsh"

## Transfer

cask "transmission"
brew "i2p"
brew "ipfs", args: ["--build-from-source"]

## Browsers

cask "google-chrome"
cask "google-chrome-canary"
cask "chromedriver"
cask "firefox-nightly"
cask "firefox"
cask "safari-technology-preview"
cask "tor-browser"
cask "opera"
cask "brave-browser-nightly"
#cask "microsoft-edge"

cask "finicky"
mas "Cascadea", id: 1432182561
mas "Refined GitHub", id: 1519867270

## Chat

brew "irssi"
cask "notion"
cask "skype"
cask "zoom"
cask "discord"
# cask "keybase"
#mas "Rocket.Chat", id: 1086818840
#mas "Jira", id: 1475897096
#mas "Slack", id: 803453959

brew "figlet"
brew "brogue"
cask "angband"
cask "google-earth-pro"

brew "cocoapods"
brew "duti"
brew "ios-deploy"
brew "ideviceinstaller"

## Virtualization

brew "docker"
brew "docker-compose"
brew "docker-machine"
cask "captain"
cask "virtualbox"

brew "minikube", args: ["--build-from-source"]
brew "kubernetes-cli"
brew "kubectl"
brew "minikube"
brew "hidetatz/tap/kubecolor"
brew "k9s"
brew "kubeshark"

brew "argo"
tap "hyperledger/fabric"
brew "hyperledger/fabric/fabric-tools@1.4.0"
brew "hyperledger/fabric/fabric-tools@2.1.0"

## Network

cask "postman"
cask "ngrok"
brew "dnsmasq"
brew "dnsviz"
brew "doggo"
brew "ettercap"
brew "ncdu"
brew "nmap"
cask "nzbvortex"
cask "wireshark"

## auth

brew "oath-toolkit"
brew "pinentry-mac"
cask "gpg-suite"
brew "git-secret"
cask "tunnelbear"
cask "openvpn-connect"
brew "gnupg"

## Git

brew "reattach-to-user-namespace"
brew "popt"
brew "hub"
brew "git-lfs"
brew "legit"
brew "git-delta"

## ??

#brew "fasd"
brew "aspell"
brew "pcre2"
brew "poppler"
brew "potrace"
brew "intltool"
brew "p7zip"
#brew "unrar"
brew "aview"
brew "colordiff"
brew "diff-so-fancy"
brew "cscope"
brew "ctags"
brew "the_silver_searcher"
brew "ack"
brew "gawk"
brew "awk"
brew "parallel"
brew "progress"
brew "markdown"
mas "RegEx Lab", id: 1252988123
mas "Gemini 2", id: 1090488118


## ??

brew "pow"
brew "automake"
brew "cmake"
brew "gradle"
brew "maven"
brew "mcrypt"
brew "stow"
brew "llvm"
brew "readline"
brew "xz"
cask "adoptopenjdk8"

## database

tap "mongodb/brew"

brew "neo4j", link: false
brew "sqlite"
brew "freetds"
brew "mysql", restart_service: true
brew "nginx", restart_service: true
brew "postgresql", restart_service: true
brew "mongodb/brew/mongocli"
cask "sequel-pro-nightly"
cask "sqlworkbenchj"
cask "valentina-studio"

brew "ollama"
cask "ollamac"

## ??

brew "avro-tools"
brew "avro-c"
brew "kafka"
brew "rabbitmq"
brew "redis", restart_service: true
# brew "temporal"

## ??

cask "r"
cask "racket"
cask "protege"
brew "sphinx-doc"
brew "stanford-corenlp"
cask "julia"
brew "vowpal-wabbit", args: ["--build-from-source"]

## ??

cask "blender"
brew "graphviz"
brew "plantuml"
cask "inkscape"
cask "gimp"
cask "omnigraffle"
cask "omnigraffle6"
#mas "skitch"
cask "sketch"
cask "drawio"

## ??

cask "rive"
mas "GIPHY CAPTURE", id: 668208984
mas "Skitch", id: 425955336

## ??

brew "tesseract"
brew "imagemagick"
brew "djvu2pdf"
brew "djvulibre"
brew "pdf-diff"
brew "d2"


## ??

cask "vlc"
brew "ffmpeg"
brew "youtube-dl"
brew "yt-dlp/taps/yt-dlp"
brew "gallery-dl"

## ??

brew "gsl"
brew "usbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "libzip"
brew "libiconv"
brew "libpq"
brew "libsodium"
brew "libsoup"
brew "libvpx"
brew "libxml++"
brew "libxml++3"
brew "little-cms"
brew "zlib"
brew "libxml2"
brew "glib"
brew "libimobiledevice"
brew "libusbmuxd"
brew "tidy-html5"
brew "xvid"
brew "libheif"

cask "qlimagesize"
cask "qlstephen"
cask "qlvideo"
cask "qlstephen"
cask "quicklookase"
cask "webpquicklook"

#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "Skitch", id: 425955336
#mas "The Unarchiver", id: 425424353
#mas "Time Out", id: 402592703
#mas "Transmit", id: 1436522307
#mas "TweetDeck", id: 485812721
#mas "Xcode", id: 497799835
#mas "iPhoto", id: 408981381
#
#mas "ChmPages", id: 1164062917
#mas "Duplicate Cleaner For iPhoto", id: 586862299
#mas "Duplicate Photos Finder", id: 984929789
#mas "Gemini 2", id: 1090488118
#mas "GrandPerspective", id: 1111570163
#mas "FreeDiskSpace", id: 838744420
#mas "SiteSucker", id: 442168834
#mas "Tot", id: 1491071483

## ??

# cask "dash"
cask "mactex"
cask "latexit"
cask "macdown"
# cask "gitkraken"


## ??

vscode "4ops.terraform"
vscode "adamrybak.graycat-sql-formatter"
vscode "ahmed-hadjou.monokai-flow"
vscode "aksamyt.solarized-zero"
vscode "alancole.gherkintablealign"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "ambooth.git-rename"
vscode "appland.appmap"
vscode "atlassian.atlascode"
vscode "azemoh.one-monokai"
vscode "bibhasdn.unique-lines"
vscode "bradlc.vscode-tailwindcss"
vscode "chouzz.vscode-better-align"
vscode "coolbear.systemd-unit-file"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "danielpetisme.vscode-vertx-starter"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dhedgecock.radical-vscode"
vscode "diamondmind.solarized-neue"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "eg2.vscode-npm-script"
vscode "esbenp.prettier-vscode"
vscode "fakesharper.fakesharper"
vscode "firsttris.vscode-jest-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "goldenmaximo.monokai-maximo"
vscode "google-cloud-spanner-ecosystem.google-cloud-spanner-driver"
vscode "gurgeous.bust-a-gem"
vscode "hallerpatrick.solarized-autumn"
vscode "hashicorp.terraform"
vscode "helgardrichard.helium-icon-theme"
vscode "ibm.ibmcloud-account"
vscode "ibmblockchain.ibm-blockchain-platform"
vscode "itarato.byesig"
vscode "jackytsu.text-transformer"
vscode "janjoerke.align-by-regex"
vscode "jduponchelle.rainbow-end"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jnbt.vscode-rufo"
vscode "johnpapa.vscode-peacock"
vscode "josetr.cmake-language-support-vscode"
vscode "jrieken.regex-notebook"
vscode "jtjoo.classic-asp-html"
vscode "juanblanco.solidity"
vscode "june07.nims"
vscode "kaiwood.endwise"
vscode "kamikillerto.vscode-colorize"
vscode "kenhowardpdx.vscode-gist"
vscode "kj.sqltools-driver-redshift"
vscode "letmaik.git-tree-compare"
vscode "markfknight.monokai-operator-theme"
vscode "mbessey.vscode-rufo"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguel-savignano.ruby-symbols"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "msjsdiag.debugger-for-chrome"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "ninoseki.vscode-gem-lens"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "phi.regexp-saver"
vscode "pomber.git-file-history"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "qrti.funclist"
vscode "rarnoldmobile.todo-txt"
vscode "rbbit.typescript-hero"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rubbersoft.scramble"
vscode "ryu1kn.partial-diff"
vscode "sanderpilon.blockalign"
vscode "shan.code-settings-sync"
vscode "shanoor.vscode-nginx"
vscode "shibayu36.open-to-other-editor-group"
vscode "shinichi-takii.sql-bigquery"
vscode "shopify.rubocop-lsp"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "shopify.vscode-shadowenv"
vscode "skattyadz.vscode-quick-scope"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "suhay.vscode-editor-group-minimizer"
vscode "surebusiness.asp-classic-support-v2"
vscode "swimm.swimm"
vscode "terrastruct.d2"
vscode "tomoki1207.pdf"
vscode "tuguldurio.monokai-aora"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
vscode "wmaurer.change-case"
vscode "xabikos.reactsnippets"
vscode "yanpp22.aspnet-beautify"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
